import time


print('Пароль...')
a = input()
if a == 'телочки меня не обойдут' or a == 'азиаточкит богини' or a == 'ты спасешьо со мной белую расу?' or a == 'я хорошо делаю куни':
    print('Обработка инцелоскота...')
    for i in range(3):
        print(i + 1)
        time.sleep(1)
    print(' '.join(list('✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️')))
    print('           Инцелоскот принят')
    print('Добро пожаловать в хуцпу, Господин Мошиах')
    print(' '.join(list('✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️✡️')))
else:
    print('тут')
    time.sleep(1)
    print('поселился')
    time.sleep(1)
    print('...')
    time.sleep(3)
    print('👹👹👹ШАЙТАН👹👹👹')
    time.sleep(2)
    print('SOS SOS 🆘 🆘 🆘 ЧТОБЫ ИЗГНАТЬ ЕГО, СОВЕРШИТЕ ДУА 🆘 🆘 🆘 SOS SOS')
    print('СЕЙЧАС ВЫСВЕТИТСЯ ТЕКСТ, ЧИТАЙТЕ ЕГО')
    time.sleep(2)
    allah = ('АЛЬХАМДУДИЛЛЯБИЛЯПИДАРСУКАУЗБИЛЛЯМАШАЛЛАХСУБХАНАЛЛАХСАБУРФИТВАБИСМИЛЛЯХСДЕЛАЙДУАЛЯИЛЛЯХАИЛЯЛЯАЛЛАХВЕЛИККАДЫРОВКРАСАВЧИКАКСТАКФЕРУЛЛАХНАМАЗСОВЕРШИСЕМЬЮЗАЩИТИ')
    for i in range(156):
        print(allah[:156 - i])
        time.sleep(0.02)
    for i in range(156):
        print(allah[:1 + i])
        time.sleep(0.02)
    for i in range(156):
        print(allah[:156 - i])
        time.sleep(0.02)
    for i in range(156):
        print(allah[:1 + i])
        time.sleep(0.02)
    for i in range(156):
        print(allah[:156 - i])
        time.sleep(0.02)
    for i in range(156):
        print(allah[:1 + i])
        time.sleep(0.02)
    time.sleep(2)
    print('           ШАЙТАН ИЗГНАН')
    print('          ПАЛЕСТИНА ЗАЛУПА')
    print('       ✡️ ✡️ ✡️ ✡️ ✡️ ТЕЛЬ-ХАЙ✡️ ✡️ ✡️ ✡️ ✡️')